"""
    正则表达式说明：
        \d: 表示数字
"""

# 产品图样式配置(每个品牌都用这个配置)
GoodsJpgStyleConfig = [
    # 单上衣图
    [{
        "patternStr": r"Shirts_(\d+)_0", # 图片名的正则公式
        "size": (800, 800),
        "pos": (0, 0),
    }],

    # 【上衣正面】与【上衣反面】的组合图
    [{
        "patternStr": r"Shirts_(\d+)_1", # 图片名的正则公式
        "size": (650, 650),
        "pos": (235, -25),
    },{
        "patternStr": r"Shirts_{0}_0", # 图片名的正则公式
        "regularParams": [(0, 1)], # 图片名的正则公式中的参数，运用了上面的正则匹配的数字
        "size": (751, 751),
        "pos": (-120, 77),
    }
    ],

    # 【上衣正面】与【无背带短裤背面】的组合图
    [    {
        "patternStr": r"Shirts_(\d+)_0", # 图片名的正则公式
        "size": (736, 736),
        "pos": (-100, 34),
    },{
        "patternStr": r"Shorts_(\d+)_1", # 图片名的正则公式
        "size": (430, 430),
        "pos": (421, 357),
    },
    ],


    # 【上衣正面】与【有背带短裤背面】的组合图
    [{
        "patternStr": r"Shirts_(\d+)_0", # 图片名的正则公式
        "size": (736, 736),
        "pos": (-100, 34),
    },{
        "patternStr": r"BibShorts_(\d+)_1", # 图片名的正则公式
        "size": (729, 729),
        "pos": (268, 70),
    },
    ],

    # 纯裤子背面图
    # [{
    #     "patternStr": r"Shorts_(\d+)_1", # 图片名的正则公式
    #     "size": (800, 800),
    #     "pos": (0, 0),
    # }],
    # [{
    #     "patternStr": r"BibShorts_(\d+)_1", # 图片名的正则公式
    #     "size": (800, 800),
    #     "pos": (0, 0),
    # }],
]